{
  "nav": {
    "home": "หน้าแรก",
    "categories": "หมวดหมู่เกม"
  },
  "search": {
    "placeholder": "ค้นหาเกม...",
    "noResults": "ไม่พบเกม",
    "backToAll": "กลับไปยังเกมทั้งหมด",
    "results": "ผลการค้นหา"
  },
  "game": {
    "backToHome": "กลับไปหน้าแรก",
    "allPlatforms": "ใช้งานได้กับทุกแพลตฟอร์ม",
    "playNow": "เล่นเลย",
    "favorite": "รายการโปรด",
    "relatedGames": "เกมที่เกี่ยวข้อง",
    "loading": "กำลังโหลดข้อมูลเกม...",
    "closeGame": "ปิดเกม"
  },
  "categories": {
    "featured": "เกมแนะนำ",
    "puzzle": "ปริศนา",
    "action": "แอคชั่น",
    "sports": "กีฬา",
    "arcade": "อาร์เคด",
    "strategy": "กลยุทธ์",
    "racing": "แข่งรถ",
    "shooting": "ยิง",
    "adventure": "ผจญภัย",
    "other": "อื่น ๆ"
  },
  "gameTranslations": {
    "titles": {
      "guess-their-answer": "ทายคำตอบของพวกเขา",
      "braindom": "เบรนดอม",
      "sort-it": "จัดเรียงมัน",
      "color-roll-3d": "คัลเลอร์ โรล 3 มิติ",
      "color-fill-3d": "คัลเลอร์ ฟิลล์ 3 มิติ",
      "spot-the-cat": "หาแมว",
      "color-water-sort-3d": "เรียงน้ำสี 3 มิติ",
      "peet-sneak": "การแอบซ่อนของพีท",
      "fashion-battle": "แฟชั่นแบทเทิล",
      "thief-puzzle": "ปริศนาขโมย",
      "cube-match": "คิวบ์แมทช์",
      "toilet-run": "วิ่งหาห้องน้ำ",
      "pair-up-3d": "จับคู่ 3 มิติ",
      "barbara-amp-kent": "บาร์บาร่าและเคนท์",
      "emoji-fun": "สนุกกับอิโมจิ",
      "cut-the-rope": "ตัดเชือก"
    },
    "descriptions": {
      "guess-their-answer": "แข่งขัน ทาย และพิชิตใน ทายคำตอบของพวกเขา - การประลองควิซสุดยอด!",
      "braindom": "ท้าทายจิตใจและเรียนรู้ประวัติศาสตร์กับ เบรนดอม - ตัวจำลองสมองชุดปริศนาสุดยอด!",
      "sort-it": "จัดเรียง วางแผน และชนะใน จัดเรียงมัน - ความท้าทายปริศนาการจัดเรียงสีสุดยอด!",
      "color-roll-3d": "กลิ้งสู่ชัยชนะใน คัลเลอร์ โรล 3 มิติ - ความท้าทายปริศนา 3 มิติสุดยอด!",
      "color-fill-3d": "เติมสีตารางพร้อมหลบหลีกอุปสรรคในเกมปริศนาที่น่าดึงดูดนี้!",
      "spot-the-cat": "ค้นพบวัตถุที่ซ่อนอยู่ใน หาแมว - เกมปริศนาค้นหาและค้นพบที่แปลกประหลาด!",
      "color-water-sort-3d": "ดำดิ่งสู่ความท้าทายที่เต็มไปด้วยสีสันของ เรียงน้ำสี 3 มิติ - ที่ซึ่งกลยุทธ์พบกับความสนุกสนานที่สดใส!",
      "peet-sneak": "แอบซ่อน วางแผน และแก้ปัญหาใน การแอบซ่อนของพีท - การผจญภัยแบบลับ ๆ สุดยอดของคุณ!",
      "fashion-battle": "อวดสไตล์และพิชิตรันเวย์ใน แฟชั่นแบทเทิล - ที่ซึ่งเฉพาะผู้ที่มีสไตล์ที่สุดจะชนะ!",
      "thief-puzzle": "เชี่ยวชาญการแอบซ่อนและกลยุทธ์ใน ปริศนาขโมย - เป็นผู้เชี่ยวชาญด้านการแอบซ่อนสุดยอดในเกมปริศนา 2 มิติที่น่าดึงดูดนี้!",
      "cube-match": "เชี่ยวชาญสัญลักษณ์และพิชิตลูกบาศก์ใน คิวบ์แมทช์ - ความรู้สึกจับคู่ลูกบาศก์ 3 มิติสุดยอด!",
      "toilet-run": "วิ่ง วาด และดำดิ่งสู่การวิ่งหาห้องน้ำสุดยอดใน วิ่งหาห้องน้ำ - ที่ซึ่งการไปถึงห้องน้ำกลายเป็นการวิ่งที่น่าตื่นเต้น!",
      "pair-up-3d": "เชี่ยวชาญศิลปะของการจับคู่ใน จับคู่ 3 มิติ! ดำดิ่งสู่โลกที่น่าดึงดูดของการจับคู่ 3 มิติ!",
      "barbara-amp-kent": "วาดและดำดิ่งสู่การวิ่งหาห้องน้ำที่ดีที่สุดจนถึงตอนนี้ บาร์บาร่าและเคนท์ - ที่ซึ่งความผ่อนคลายสุดยอดคือเป้าหมายสุดท้าย!",
      "emoji-fun": "ปลดปล่อยผู้เชี่ยวชาญอิโมจิในตัวคุณใน สนุกกับอิโมจิ - เกมปริศนาสุดยอดที่คุณต้องเชื่อมต่ออิโมจิที่ถูกต้อง!",
      "cut-the-rope": "ป้อนอาหารให้กับมอนสเตอร์น่ารัก อม นม ด้วยลูกอมในเกมปริศนาที่อิงกับฟิสิกส์นี้!"
    }
  }
} 